import random

##################################################################################
#[0] * 30表示生成一個30個元素的列表，裡面每個元素都是0，生成16個這樣的列表
board = [[0] * 30 for i in range(16)]

#sample(a,k) a中隨機選擇k個元素，選擇的元素互不重複，randint()函数生成該数量的随機數字
mines = random.sample(range(480), random.randint(1, 480))
##################################################################################

for mine in mines:    
    #第幾排第幾個存炸彈
    a= mine // 30
    b= mine % 30

    board[a][b] = '*'

for i in range(16):
    for j in range(30):
##################################################################################
        if board[i][j] == '*':
            continue
        count = 0
        #因為使用max和min函數，這樣即使索引超出了範圍，它也會被設置為列表的第一個或最後一個元素的索引
        for r in range(max(0, i-1), min(i+2, 16)):
            for c in range(max(0, j-1), min(j+2, 30)):
        
                if board[r][c] == '*':
                    count += 1
        if count > 0:
            board[i][j] = count
        elif  count == 0:
            board[i][j] = "|"

##################################################################################
# 轉換空格
'''
for i in range(16):
    for j in range(30):
        if board[i][j] == 0:
            board[i][j] = "|"
'''
for i in range(16):
    for j in range(30):
##################################################################################
        print(board[i][j], end='')# end=''讓結果不換行
	print()#一排結束後換行
##################################################################################